src/test/resources/org/lockss/ws/hasher/hashAsynchronouslyRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/HasherService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://hasher.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:hashAsynchronously>
            <hasherParams>
                <auId>org|lockss|plugin|hindawi|HindawiPublishingCorporationPlugin&amp;base_url~http%3A%2F%2Fwww%2Ehindawi%2Ecom%2F&amp;download_url~http%3A%2F%2Fdownloads%2Ehindawi%2Ecom%2F&amp;journal_id~aaa&amp;volume_name~1996</auId>
            </hasherParams>
        </service:hashAsynchronously>
    </soapenv:Body>
</soapenv:Envelope>
